CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_dma.c
/*!
    \brief      check DMA interrupt flag is set or not 
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to get interrupt flag
      \arg        DMA_CHx(x=0..7)
    \param[in]  interrupt: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_INT_FLAG_FEE: FIFO error and exception interrupt flag
      \arg        DMA_INT_FLAG_SDE: single data mode exception interrupt flag
      \arg        DMA_INT_FLAG_TAE: transfer access error interrupt flag
      \arg        DMA_INT_FLAG_HTF: half transfer finish interrupt flag
      \arg        DMA_INT_FLAG_FTF: full transger finish interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dma_interrupt_flag_get(uint32_t dma_periph, dma_channel_enum channelx, uint32_t int_flag)
{
    uint32_t interrupt_enable = 0U,interrupt_flag = 0U;
    dma_channel_enum channel_flag_offset = channelx;
    if(channelx < DMA_CH4){
        switch(int_flag){
        case DMA_INTF_FEEIF:
            interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(int_flag, channelx);
            interrupt_enable = DMA_CHFCTL(dma_periph, channelx) & DMA_CHXFCTL_FEEIE;
            break;
        case DMA_INTF_SDEIF:
            interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(int_flag, channelx);
            interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_SDEIE;
            break;
        case DMA_INTF_TAEIF:
            interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(int_flag, channelx);
            interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_TAEIE;
            break;
        case DMA_INTF_HTFIF:
            interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(int_flag, channelx);
            interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_HTFIE;
            break;
        case DMA_INTF_FTFIF:
            interrupt_flag = (DMA_INTF0(dma_periph) & DMA_FLAG_ADD(int_flag, channelx));
            interrupt_enable = (DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_FTFIE);
            break;
        default:
            break;
        }
    }else{
        channel_flag_offset -= (dma_channel_enum)4;
        switch(int_flag){
        case DMA_INTF_FEEIF:
            interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(int_flag, channel_flag_offset);
            interrupt_enable = DMA_CHFCTL(dma_periph, channelx) & DMA_CHXFCTL_FEEIE;
            break;
        case DMA_INTF_SDEIF:
            interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(int_flag, channel_flag_offset);
            interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_SDEIE;
            break;
        case DMA_INTF_TAEIF:
            interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(int_flag, channel_flag_offset);
            interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_TAEIE;
            break;
        case DMA_INTF_HTFIF:
            interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(int_flag, channel_flag_offset);
            interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_HTFIE;
            break;
        case DMA_INTF_FTFIF:
            interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(int_flag,channel_flag_offset);
            interrupt_enable = DMA_CHCTL(dma_periph,channelx) & DMA_CHXCTL_FTFIE;
            break;
        default:
            break;
        }
    }
    
    if(interrupt_flag && interrupt_enable){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear DMA a channel interrupt flag
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to clear interrupt flag
      \arg        DMA_CHx(x=0..7)
    \param[in]  interrupt: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_INT_FLAG_FEE: FIFO error and exception interrupt flag
      \arg        DMA_INT_FLAG_SDE: single data mode exception interrupt flag
      \arg        DMA_INT_FLAG_TAE: transfer access error interrupt flag
      \arg        DMA_INT_FLAG_HTF: half transfer finish interrupt flag
      \arg        DMA_INT_FLAG_FTF: full transger finish interrupt flag
    \param[out] none
    \retval     none
*/
void dma_interrupt_flag_clear(uint32_t dma_periph, dma_channel_enum channelx, uint32_t int_flag)
{
    if(channelx < DMA_CH4){
        DMA_INTC0(dma_periph) |= DMA_FLAG_ADD(int_flag, channelx);
    }else{
        channelx -= (dma_channel_enum)4;
        DMA_INTC1(dma_periph) |= DMA_FLAG_ADD(int_flag, channelx);
    }
}

/*!
    \brief      enable DMA interrupt
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel 
      \arg        DMA_CHx(x=0..7)
    \param[in]  source: specify which interrupt to enbale
                one or more parameters can be selected which are shown as below:
      \arg        DMA_INT_SDE: single data mode exception interrupt enable
      \arg        DMA_INT_TAE: tranfer access error interrupt enable
      \arg        DMA_INT_HTF: half transfer finish interrupt enable
      \arg        DMA_INT_FTF: full transfer finish interrupt enable
      \arg        DMA_INT_FEE: FIFO exception interrupt enable
    \param[out] none
    \retval     none
*/
void dma_interrupt_enable(uint32_t dma_periph, dma_channel_enum channelx, uint32_t source)
{
    if(DMA_CHXFCTL_FEEIE != source){
        DMA_CHCTL(dma_periph, channelx) |= source;
    }else{
        DMA_CHFCTL(dma_periph, channelx) |= source;
    }
}

/*!
    \brief      disable DMA interrupt
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel 
      \arg        DMA_CHx(x=0..7)
    \param[in]  source: specify which interrupt to disbale
                one or more parameters can be selected which are shown as below:
      \arg        DMA_INT_SDE: single data mode exception interrupt enable
      \arg        DMA_INT_TAE: tranfer access error interrupt enable
      \arg        DMA_INT_HTF: half transfer finish interrupt enable
      \arg        DMA_INT_FTF: full transfer finish interrupt enable
      \arg        DMA_INT_FEE: FIFO exception interrupt enable
    \param[out] none
    \retval     none
*/
void dma_interrupt_disable(uint32_t dma_periph, dma_channel_enum channelx,uint32_t source)
{
    if(DMA_CHXFCTL_FEEIE != source){
        DMA_CHCTL(dma_periph, channelx) &= ~source;
    }else{
        DMA_CHFCTL(dma_periph, channelx) &= ~source;
    }
}
/*!
    \brief      configure security attribution of DMA channel
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
      \arg        DMA_CHx(x=0..7)
    \param[in]  security: security attribution of this channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHANNEL_SECURE: secure mode
      \arg        DMA_CHANNEL_NONSECURE: non-secure mode
      \arg        DMA_CHANNEL_SOURCE_SECURE: the secure DMA transfer from the source
      \arg        DMA_CHANNEL_SOURCE_NONSECURE: the non-secure DMA transfer from the source
      \arg        DMA_CHANNEL_DESTINATION_SECURE: the secure DMA transfer to the destination 
      \arg        DMA_CHANNEL_DESTINATION_NONSECURE: the non-secure DMA transfer to the destination 
    \param[out] none
    \retval     none 
*/
void dma_security_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t security)
{
    uint32_t ctl;
    /* acquire DMA_CHxCTL register */
    ctl = DMA_CHSCTL(dma_periph, channelx);
    /* assign regiser */
    ctl &= ~(DMA_CHXSCTL_SECM|DMA_CHXSCTL_SSEC|DMA_CHXSCTL_DSEC);
    ctl |= security;
    DMA_CHSCTL(dma_periph, channelx) = ctl;
}
/*!
    \brief      configure privileged mode of DMA channel
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
      \arg        DMA_CHx(x=0..7)
    \param[in]  priv: privileged mode of this channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHANNEL_PRIV: privileged mode
      \arg        DMA_CHANNEL_NONPRIV: non-privileged mode
    \param[out] none
    \retval     none 
*/
void dma_priv_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t priv)
{
    uint32_t ctl;
    /* acquire DMA_CHxCTL register */
    ctl = DMA_CHSCTL(dma_periph, channelx);
    /* assign regiser */
    ctl &= ~DMA_CHXSCTL_PRIV;
    ctl |= priv;
    DMA_CHSCTL(dma_periph, channelx) = ctl;
}
/*!
    \brief      check DMA channel illegal flag is set or not
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none 
*/
FlagStatus dma_illegal_access_flag_get(uint32_t dma_periph, dma_channel_enum channelx)
{
    uint32_t ctl;
    ctl = DMA_SSTAT(dma_periph);
    if((ctl >> channelx) & 0x1U){
        return SET;
    }else{
        return RESET;
    }
}
/*!
    \brief      clear DMA channel illegal flag
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none 
*/
void dma_illegal_access_flag_clear(uint32_t dma_periph, dma_channel_enum channelx)
{
    DMA_SSC(dma_periph) |= (0x1U << channelx);
}
